       IDENTIFICATION DIVISION.
       PROGRAM-ID. SOMA2.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMERO-1     PIC 9(3) VALUE 10.
       01 NUMERO-2     PIC 9(3) VALUE 20.
       01 RESULTADO    PIC 9(4).

       PROCEDURE DIVISION.
           ADD NUMERO-1 TO NUMERO-2 GIVING RESULTADO
           DISPLAY "RESULTADO = " RESULTADO
           STOP RUN.
